<template>
  <UiSection
    class="content__wrapper"
    :padding="'64px 40px 0 40px'"
    :background="`white`"
  >
    <UiSectionTitle :title-text="sectionTitle" />
    <div class="container">
      <div class="q-py-md left-side">
        <q-timeline :layout="layout" color="primary">
          <q-timeline-entry
            title="Основание Треста «Электромонтаж-55»"
            subtitle="21 Января 1950 года"
            side="left"
          >
            <div class="text small">
              Трест «Электромонтаж-55» образован на основании распоряжения
              Совета Министров СССР № 674-р от 21.01.1950 года. Трест при его
              образовании входил в состав Главэлектромонтажа Министерства
              строительства предприятий машиностроения СССР.
            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="Объединение с трестом «Севзапэлектромонтаж»"
            subtitle="28 Марта 1953 года"
            side="right"
          >
            <div class="text small">
              Согласно распоряжению Совета Министров СССР № 5641-р от 28.03.1953
              года трест «Электромонтаж-55» был объединён с трестом
              «Севзапэлектромонтаж», входящим в состав вновь образованного
              Министерства строительства СССР.
            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="Восстановление треста в составе Главэлектромонтажа"
            subtitle="18 Мая 1954 года"
            side="left"
          >
            <div class="text small">
              На основании Постановления Совета Министров СССР от 18.05.1954
              года № 941 восстановлен трест «Электромонтаж-55» в составе
              Главэлектромонтажа Министерства строительства СССР (приказ
              Минстроя № 20 от 19.05.1954 года).
            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="Переход в состав
          Главленинградстроя"
            subtitle="11 Марта 1957"
            side="right"
          >
            <div class="text small">
              На основании Постановления Совета Министров СССР от 11.03.1957
              года № 259 трест «Электромонтаж-55» из подчинения
              Главэлектромонтажа Министерства строительства СССР выведен и
              передан в состав Главленинградстроя при Ленгорисполкоме
              Ленинграда.
            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="Преобразование в акционерное общество открытого типа"
            subtitle="01 Июля 1992 года"
            side="left"
          >
            <div class="text small">
              В соответствии с Указом Президента Российской Федерации «Об
              организационных мерах по преобразованию государственных
              предприятий, добровольных объединений государственных предприятий
              в акционерное общество» от 1.07.1992 года № 721 трест
              «Электромонтаж-55» преобразован в акционерное общество открытого
              типа «Электромонтаж-55» (распоряжение КУГИ от 22.07.1992 года №
              27-БП; Свидетельство о государственной регистрации № 1049 от
              29.07.1992 года; решение Регистрационной Палаты Мэрии
              Санкт-Петербурга № 1218 от 29.07.1992 года).
            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="Преобразование в общество с ограниченной ответственностью и вход в группу компаний «ГРАНИТ»."
            subtitle="2015 год - Наши дни"
            side="right"
          >
            <div class="text small">
              С 2015 года ОАО «Электромонтаж-55» преобразован в ООО
              «Электромонтаж-55», который до настоящего времени является
              преемником и продолжателем традиций компании в областях
              проектирования, производства, монтажа, наладки и введения в
              эксплуатацию различной электротехнической продукции.
            </div>
          </q-timeline-entry>
        </q-timeline>
      </div>
      <div class="q-px-lg q-py-md right-side">
        <picture class="picture__container"
          ><img
            src="Images/team.png"
            alt="картинка"
            class="picture"
            width="100%"
          />
        </picture>
        <p class="text">
          В состав ООО «Электромонтаж-55» входят три структурных подразделения:
          <strong
            >электромонтажное производство (ЭП ЭМ-55) Завод Электромонтаж
            55</strong
          >, <strong>управление наладочных работ (УНР-422)</strong> и
          <strong>управление пуско-наладочных работ (УПНР-427).</strong>
        </p>
        <p class="text">
          Всё изготавливаемое ООО «Электромонтаж-55» электротехническое
          оборудование, а именно: блочные комплектные подстанции
          (трансформаторные и распределительные); камеры распредустройств 6-10
          кВ различных серий; КТПН; УВРУ (УВР); панели ЩО-70, ГРЩ, ГЩВУ,
          осветительные и силовые щиты, ящики управления и другие изделия
          сертифицировано Госстандартом России и согласовано с филиалом
          «Кабельная сеть» ПАО «Россети Ленэнерго» и одобрено Ростехнадзором.
        </p>
        <p class="text">
          В настоящее время ООО «Электромонтаж-55» разработаны и внедряются
          высокоэффективные распределительно-трансформаторные и трансформаторные
          подстанции в блочном исполнении не имеющие аналогов по заложенным в
          них функциональным возможностям.
        </p>
        <p class="text">
          Наши традиционные заказчики находятся в Санкт-Петербурге и в
          Северо-Западной части России.
        </p>
        <p class="text">
          За период своего функционирования организация изготовила оборудование
          и выполнила проектные, электромонтажные и пуско-наладочные работы на
          объектах:
        </p>
        <ul>
          <li class="text bold">
            <ListIcon />
            на кирпичных и крупнопанельных жилых домах (с общим количеством
            квартир более 2 млн.)
          </li>
          <li class="text bold"><ListIcon /> на школах (более 600 школ)</li>
          <li class="text bold">
            <ListIcon /> на детских садах (более 800 детских садов)
          </li>
          <li class="text bold">
            <ListIcon /> на объектах здравоохранения (более 200 поликлиник, 20
            больниц)
          </li>
          <li class="text bold">
            <ListIcon /> на стадионах им. Кирова (теперь на этом месте новый
            комплекс «Газпром Аре́на») и Петровский
          </li>
          <li class="text bold">
            <ListIcon />на спортивно-концертном комплексе «Петербургский» на 25
            тыс. мест (теперь на этом месте новый комплекс «СКА Арена».)
          </li>
          <li class="text bold"><ListIcon /> на дворце спорта «Юбилейный»</li>
          <li class="text bold">
            <ListIcon /> на концертном зале «Октябрьский»
          </li>
          <li class="text bold">
            <ListIcon /> на гостиницах «Спутник», «Советская»(нов. название
            «А́зимут Отель Санкт-Петербург»), «Ленинград» (нов. название Отель
            Санкт-Петербург), «Октябрьская» и др.
          </li>
          <li class="text bold">
            <ListIcon /> на объектах аэропорта «Пулково»
          </li>
          <li class="text bold">
            <ListIcon /> на птицефабриках, овощехранилищах и др.
          </li>
          <li class="text bold">
            <ListIcon /> на предприятиях торговли и общественного питания
          </li>
        </ul>

        <p class="text">
          <strong
            >На распределительных подстанциях (более 400) и трансформаторных
            подстанциях (более 4000), что составляет порядка 75-80% всех
            действующих подстанций Санкт-Петербурга на период 2014 года
            проложено более 500 тыс. км. кабеля 0,4-10 кВ, а на квартальных
            котельных (более 50 тыс. км.)</strong
          >
        </p>
      </div>
    </div>
  </UiSection>
</template>

<script setup>
import UiSection from "src/components/UiSection.vue";
import UiSectionTitle from "src/components/UiSectionTitle.vue";
import ListIcon from "src/components/icons/ListIcon.vue";

const sectionTitle = 'История "ООО ЭЛЕКТРОМОНТАЖ"';
</script>

<style scoped>
.container {
  display: flex;
  justify-content: space-between;
}

.left-side {
  width: 40%;
  background-color: var(--background-light-accent);
  padding-right: 10px;
}

.right-side {
  width: 55%;
  padding-right: 0px;
  padding-left: 10px;
}

.text {
  text-indent: 40px;
  font-size: clamp(1.1rem, 1vw, 1.2rem);
  font-family: Montserrat-regular, serif;
  line-height: 30px;
}

.small {
  text-indent: 0px;
  font-size: clamp(0.9rem, 1vw, 1rem);
}

.bold {
  text-align: left;
  text-indent: 0px;
}
.picture__container {
  margin: 0 auto;
}
.picture {
  object-fit: cover;
  border-radius: 8px;
}
li {
  display: flex;
  align-items: center;
  gap: 10px;
}
.icon {
  min-width: 20px;
}

@media (max-width: 768px) {
  .container {
    flex-direction: column;
  }
  .content__wrapper {
    padding: 64px 10px 0 10px;
  }

  .left-side {
    width: 100%;
    padding-left: 0px;
  }

  .right-side {
    width: 100%;
  }
}
</style>
