<script setup>
import UiSection from "../components/UiSection.vue";
import UiSectionTitle from "src/components/UiSectionTitle.vue";
import BreadCrumbs from "src/components/BreadCrumbs.vue";
import QuestionCard from "src/components/QuestionCard.vue";
const sectionTitle = "Вопрос-Ответ";

const questions = [
  {
    id: 1,
    question: "Что входит в трансформаторную подстанцию?",
    answer:
      "В состав трансформаторной подстанции входят следующие элементы: Силовой трансформатор. Преобразовывает электроэнергию в другое качество напряжения.Шины. Обеспечивают подвод приходящего напряжения и отвод нагрузок.Силовые коммутационные аппараты с тоководами, позволяющие перераспределять электроэнергию. Системы защит, автоматики, управления, сигнализации, измерения. Применяются для бесперебойной работы подстанции в автоматическом режиме, предотвращения её неисправностей и поломок.Распределительные устройства. Служат для распределения электроэнергии и доставки её на объекты.Вводные и вспомогательные устройства. К ним относятся изоляторы, разъединители, выключатели, отделители и другие элементы для подключения кабельных и воздушных линий.Также трансформаторные подстанции оснащают системой автоматического ввода резерва (АВР), осуществляющей переподключение на запасной источник электроснабжения, и прочим оборудованием, необходимым для эффективной, безопасной и стабильной работы.",
  },
  {
    id: 2,
    question: "Что такое БКТП?",
    answer:
      "БКТП — это блочная комплектная трансформаторная подстанция, которая представляет собой готовый модуль в бетонном или железобетонном корпусе. В ней объединены все необходимые элементы: трансформаторы, распределительные устройства, системы защиты и автоматизации.",
  },
  {
    id: 3,
    question: "Для чего используют БКТП?",
    answer:
      "Такие подстанции применяют для электроснабжения жилых кварталов, промышленных предприятий, транспортных узлов, крупных строительных площадок, нефтегазовых месторождений и других объектов.",
  },
  {
    id: 4,
    question: "Какие преимущества у БКТП?",
    answer:
      "К ним относятся высокая степень готовности к эксплуатации, возможность быстрой доставки и установки, компактные размеры и универсальность применения.",
  },
  {
    id: 5,
    question: "Какие технические характеристики БКТП?",
    answer:
      "Основные из них: напряжение сети низкого напряжения — до 1000 В, напряжение сети высокого напряжения — до 20 кВ, производительность силового трансформатора — от 25 до 1600 кВА в зависимости от модификации и другие.",
  },
  {
    id: 6,
    question: "Что такое КТПН?",
    answer:
      "КТПН – это комплектная трансформаторная подстанция наружной установки. Основные технические характеристики КТПН:Мощность силового трансформатора: 25 – 1600 кВА.Напряжение РУВН: 6, 10 кВ. Напряжение РУНН: 0,4 кВ. ",
  },
  {
    id: 7,
    question: "Какие особенности и достоинства КТПН?",
    answer:
      "Устанавливаются и эксплуатируются только снаружи зданий. Мобильны, их можно транспортировать как полностью собранными, так и в виде отдельных блоков. Защищены от температурных колебаний, сильного ветра, атмосферных осадков, попадания пыли и грязи. Конструкция представляет собой силовой каркас с обшивкой из листовой стали. Стены могут быть заполнены утеплителем, шумоизоляцией или иными материалами. Применяются в населённых пунктах, промышленном секторе, горнодобывающей отрасли, и других объектах. Можно комплектовать дополнительным оборудованием для решения тех или иных задач. Благодаря наличию систем защиты безопасны в эксплуатации.",
  },
  {
    id: 8,
    question: "Что такое КСО?",
    answer:
      "КСО - камеры сборные одностороннего обслуживания с номинальным напряжением 6 кВ и 10 кВ. Предназначены для приёма и распределения электроэнергии трёхфазного переменного тока частотой 50 Гц напряжением 6–10 кВ в сетях с изолированной или заземлённой через дугогасящий реактор нейтралью.",
  },
  {
    id: 9,
    question: "Какие технические характеристики КСО?",
    answer:
      "номинальное напряжение: 6 и 10 кВ; номинальное рабочее напряжение: 7,2 и 12 кВ; номинальный ток главных цепей камер: до 1600 А; номинальный ток термической стойкости главных цепей: 20 кА; номинальный ток электродинамической стойкости главных цепей: 51 кА; климатическое исполнение и категория размещения: У3; срок службы до списания: - не менее 30 лет.",
  },
  {
    id: 10,
    question: "Что такое устройство вводно-распределительное 0,4 кВ (УВР)?",
    answer:
      "УВР – предназначено для внутренней установки в ТП, БКТП, КТП, жилых и общественных зданиях. Его функции: приём, распределение и учёт электроэнергии трёхфазного переменного тока частотой 50 Гц напряжением 380/220 В, а также защита групповых линий при перегрузках и коротких замыканиях. Конструкция УВР представляет собой металлический шкаф, выполненный из гнутых металлических стальных профилей, скреплённых между собой сваркой или метизами и окрашенный порошковой эмалью. Двери шкафов закрываются на замок. Крупные многопанельные УВР состоят из нескольких металлических шкафов, жёстко скреплённых друг с другом, внутри которых установлено оборудование для защиты от перегрузки и короткого замыкания, отключения, ручного или автоматического переключения питающей сети и нагрузок.",
  },
  {
    id: 11,
    question: "Какие особенности и достоинства УВР?",
    answer:
      "модульность системы, позволяющая сконфигурировать устройство для широкого диапазона применений; возможность изменения конфигурации; возможность расширения устройства путём добавления секций при увеличении числа приёмников электрической энергии; максимальная безопасность эксплуатирующего персонала; интуитивно понятное и удобное обслуживание; высокий номинальный ток сборных шин — 4000 А; поставка секций в полной заводской готовности.",
  },
  {
    id: 12,
    question: "Какие технические характеристики УВР?",
    answer:
      "номинальное рабочее напряжение: 0,4 кВ; номинальная частота: 50 Гц; номинальный ток: не более 4000 А; номинальный кратковременно допустимый ток при времени протекания 1 с: не более 100 кА; номинальное напряжение вспомогательных цепей: 220 В; степень защиты оболочки по ГОСТ 14254: IP21, IP31, IP54. ",
  },
];
</script>

<template>
  <UiSection
    class="content__wrapper"
    :padding="$q.screen.width > 768 ? '64px 40px 0 40px' : '32px 20px 0 20px'"
  >
    <BreadCrumbs :page-route="sectionTitle" />
    <UiSectionTitle tag="h1" :title-text="sectionTitle" />
    <article class="partner-cards">
      <QuestionCard
        v-for="(question, index) in questions"
        :key="index"
        :id="question.id"
        :question="question.question"
        :answer="question.answer"
      />
    </article>
  </UiSection>
  <UiSection
    class="content__wrapper"
    :padding="$q.screen.width > 768 ? '64px 40px 0 40px' : '32px 20px 0 20px'"
  >
    <p class="question__text">
      Если у Вас остались вопросы, напишите нам, заполнив форму. Мы с
      удовольствием предоставим ответ на интересующий Вас вопрос.
    </p>
    <div class="question__button-wrapper">
      <q-btn
        unelevated
        style="width: 350px"
        class="question__button"
        color="primary"
        :to="{ path: '/', hash: '#form' }"
      >
        Задать вопрос
      </q-btn>
    </div>
  </UiSection>
</template>
<style scoped>
.partner-cards {
  display: flex;
  flex-direction: column;
  gap: 10px;
}

.second__title {
  align-self: flex-start;
  font-family: Montserrat-regular, serif;
  font-size: clamp(1.3rem, 2.3vw, 1.7rem);
  line-height: 1em;
}
.question__text {
  font-family: Montserrat-regular, serif;
  font-size: clamp(1rem, 1vw, 1.2rem);
}
.question__button-wrapper {
  display: flex;
  justify-content: center;
}
.question__button {
  width: 350px;
  height: 60px;
  text-transform: none;
  border-radius: 8px;
  font-family: Montserrat-bold, serif;
  font-size: 1rem;
  font-weight: 400;
  line-height: 21.6px;
  transition: 0.3s linear;
}
@media (hover: hover) {
  .question__button:hover {
    color: var(--q-accent) !important;
  }
}
</style>
